Revit 2027 API
TileBrickType Enumeration
 The enumerated type representing the permitted values for the asset property "TileBrickType" from the "Tile" schema.
Namespace: Autodesk.Revit.DB.Visual
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public enum TileBrickType
Public Enumeration TileBrickType
public enum class TileBrickType
type TileBrickType
Members
Member name | Value | Description
CommonFlemishBond | 1
Custom | 7
EnglishBond | 2
FineRunningBond | 5
FineStackBond | 6
HalfRunningBond | 3
RunningBond | 0
StackBond | 4
See Also
Reference
Autodesk.Revit.DB.Visual Namespace